spec/fixtures/webhooks/stripe/invoice.payment_succeeded.json

{
  "created": 1326853478,
  "livemode": false,
  "id": "evt_00000000000000",
  "type": "invoice.payment_succeeded",
  "object": "event",
  "request": null,
  "pending_webhooks": 1,
  "api_version": "2019-12-03",
  "data": {
    "object": {
      "id": "in_00000000000000",
      "object": "invoice",
      "account_country": "US",
      "account_name": "Local Orbit (Rob Local Platform)",
      "amount_due": 0,
      "amount_paid": 0,
      "amount_remaining": 0,
      "application_fee_amount": null,
      "attempt_count": 0,
      "attempted": true,
      "auto_advance": true,
      "billing_reason": "manual",
      "charge": "ch_19HJd82VpjOYk6TmrzJdKLYR",
      "collection_method": "charge_automatically",
      "created": 1580768623,
      "currency": "usd",
      "custom_fields": null,
      "customer": "cus_00000000000000",
      "customer_address": null,
      "customer_email": null,
      "customer_name": null,
      "customer_phone": null,
      "customer_shipping": null,
      "customer_tax_exempt": "none",
      "customer_tax_ids": [
      ],
      "default_payment_method": null,
      "default_source": null,
      "default_tax_rates": [
      ],
      "description": null,
      "discount": null,
      "due_date": null,
      "ending_balance": null,
      "footer": null,
      "hosted_invoice_url": null,
      "invoice_pdf": null,
      "lines": {
        "data": [
          {
            "id": "il_00000000000000",
            "object": "line_item",
            "amount": 100,
            "currency": "usd",
            "description": "1 × ACCELERATE_2017 (at $1.00 / month)",
            "discountable": true,
            "livemode": false,
            "metadata": {
            },
            "period": {
              "end": 1583274223,
              "start": 1580768623
            },
            "plan": {
              "id": "ACCELERATE_00000000000000",
              "object": "plan",
              "active": true,
              "aggregate_usage": null,
              "amount": 100,
              "amount_decimal": "100",
              "billing_scheme": "per_unit",
              "created": 1519181349,
              "currency": "usd",
              "interval": "month",
              "interval_count": 1,
              "livemode": false,
              "metadata": {
              },
              "nickname": null,
              "product": "prod_00000000000000",
              "tiers": null,
              "tiers_mode": null,
              "transform_usage": null,
              "trial_period_days": null,
              "usage_type": "licensed"
            },
            "proration": false,
            "quantity": 1,
            "subscription": "sub_00000000000000",
            "subscription_item": "si_00000000000000",
            "tax_amounts": [
            ],
            "tax_rates": [
            ],
            "type": "subscription"
          }
        ],
        "has_more": false,
        "object": "list",
        "url": "/v1/invoices/in_1G8DKVJ4hf6jslrzlx2qCx8U/lines"
      },
      "livemode": false,
      "metadata": {
      },
      "next_payment_attempt": 1580772223,
      "number": "D1BBB786-DRAFT",
      "paid": true,
      "payment_intent": null,
      "period_end": 1580768623,
      "period_start": 1580768623,
      "post_payment_credit_notes_amount": 0,
      "pre_payment_credit_notes_amount": 0,
      "receipt_number": null,
      "starting_balance": 0,
      "statement_descriptor": null,
      "status": "draft",
      "status_transitions": {
        "finalized_at": null,
        "marked_uncollectible_at": null,
        "paid_at": null,
        "voided_at": null
      },
      "subscription": "sub_9aUc7u7cc8IStf",
      "subtotal": 0,
      "tax": null,
      "tax_percent": null,
      "total": 0,
      "total_tax_amounts": [
      ],
      "webhooks_delivered_at": null,
      "closed": true
    }
  }
}